using System;

namespace _05._Special_Numbers
{
    class Program
    {
        static void Main(string[] args)
        {
            //Да се напише програма, която чете едно цяло число N, въведено от потребителя, и генерира всички
            //възможни "специални" числа от 1111 до 9999.За да бъде "специалнo" едно число, то трябва да отговаря
            //на следното условие: 
            //•	N да се дели на всяка една от неговите цифри без остатък.
            //Пример: при N = 16, 2418 е специално число:
            //•	16 / 2 = 8 без остатък
            //•	16 / 4 = 4 без остатък
            //•	16 / 1 = 16 без остатък
            //•	16 / 8 = 2 без остатък
            //Вход
            //Входът се чете от конзолата и се състои от едно цяло число в интервала[1…600000]
            //Изход
            //На конзолата трябва да се отпечатат всички "специални" числа, разделени с интервал
            int n = int.Parse(Console.ReadLine());
            for (int i = 1; i < 9; i++)
            {
                for (int j = 1; j < 9; j++)
                {
                    for (int k = 1; k < 9; k++)
                    {
                        for (int l = 1; l < 9; l++)
                        {
                            if (n % i == 0 && n % j == 0 && n % k == 0 && n % l == 0)
                            {
                                Console.Write($"{i}{j}{k}{l} ");
                            }
                        }
                    }
                }
            }
        }
    }
}
