using System;

namespace _01Moon
{
    class Program
    {
        static void Main(string[] args)
        {
            //Георги е космонавт и следващата му мисия е да отиде до Луната. Ако се движи със скорост от X километра в
            //час, той ще стигне до там за N часа.Приемаме, че разстоянието между Луната и Земята е 384 400 км.Георги ще
            //прекара 3 часа на Луната, след което ще тръгне обратно към Земята.
            //Напишете програма, която пресмята за колко часа Георги ще отиде и ще се върне и колко литра гориво ще
            //са му нужни.
            //          Вход:
            //Входът се чете от конзолата и съдържа точно 2 реда:
            //•	На първия ред - средната скорост на движение - реално число в интервала[1000.00... 30000.00]
            //•	На втория ред - литри гориво нужни за 100 км - реално число в интервала[1.00…20.00]
            //Изход:
            //            Да се отпечатат на конзолата два реда:
            //•	Броят на часовете, за които Георги е отишъл и се е върнал(резултатът да се закръгли до по - голямото цяло число).
            //•	Количеството литри гориво, което е нужно за пътуването.

            int distance = 2 * 384400;
            double averageSpeed = double.Parse(Console.ReadLine());
            double litersPer100km = double.Parse(Console.ReadLine());
            double timeForTheTrip = distance / averageSpeed;
            double totalTime = Math.Ceiling(timeForTheTrip) + 3;
            double fuel = litersPer100km * distance / 100;
            Console.WriteLine(totalTime);
            Console.WriteLine(fuel);

        }
    }
}
